app/views/source/_unlogined_user.html.erb

<div class="col-md-3">
  <p>Users: <%= User.count %> registered</p>
---
SELECT COUNT(*) FROM "users"