app/views/articles/index.html.erb

SELECT COUNT(*) FROM "users"
---

		<p>Users: <%= User.count %> registered</p>