app/views/articles/show.html.erb

SELECT  1 AS one FROM "comments"  WHERE "comments"."article_id" = ? LIMIT 1  [["article_id", 1]]
SELECT "comments".* FROM "comments"  WHERE "comments"."article_id" = ?  [["article_id", 1]]
---

				<% if @article.comments.exists? %>

SELECT COUNT(*) FROM "users"
---
	<div class="col-md-3">
		<p>Users: <%= User.count %> registered</p>