app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"   ORDER BY "articles"."id" DESC
---
  def index
    @articles = Article.all.order(id: :desc)