app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 14]]
INSERT INTO "comments" ("article_id", "body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 14], ["body", "1346576887"], ["created_at", "2014-08-13 12:46:06.341835"], ["title", "123456"], ["updated_at", "2014-08-13 12:46:06.341835"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.valid?
      @comment.save

SELECT  "comments".* FROM "comments"  WHERE "comments"."user_id" = ? AND "comments"."id" = ? LIMIT 1  [["user_id", 1], ["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
  def destroy
    @comment = current_user.comments.find(params[:id])
    @comment.destroy