app/controllers/users_articles_controller.rb

SELECT "articles".* FROM "articles"  WHERE "articles"."user_id" = ?  ORDER BY "articles"."id" DESC  [["user_id", 1]]
---
  def index
  	@user = current_user.name
    @articles = current_user.articles.order(id: :desc)

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 1], ["id", 15]]
---
  def show
    @article = Article.find(params[:id])

INSERT INTO "articles" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "12345"], ["created_at", "2014-08-07 14:02:28.635737"], ["title", "test user"], ["updated_at", "2014-08-07 14:02:28.635737"], ["user_id", 1]]
---
  def create
  	@article = Article.new(article_params)
  	@article.user = current_user

  	if @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 1], ["id", 15]]
---
  def edit
    @article = Article.find(params[:id])

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 1], ["id", 15]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = 14  [["title", "123456700-"], ["updated_at", "2014-08-13 09:57:19.316023"]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 1], ["id", 15]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy